![logo_ironhack_blue 7](https://user-images.githubusercontent.com/23629340/40541063-a07a0a8a-601a-11e8-91b5-2f13e4e6b441.png)

# Lab | SQL Queries 9

#### 1. Create a Python connection with `SQL` database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [10]:
from sqlalchemy import create_engine # let's connect to SQL
import pandas as pd
from getpass import getpass
password = getpass("Please, kindly insert your password:")

Please, kindly insert your password:········

In [33]:
# Creating a safe connection
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

#### 2. Check the number of rentals for each customer for `May`

In [34]:
may_rentals = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
may_rentals.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24,367,130,2005-05-26,1,2006-02-15
1,2,2005-05-24,1525,459,2005-05-28,1,2006-02-15
2,3,2005-05-24,1711,408,2005-06-01,1,2006-02-15
3,4,2005-05-24,2452,333,2005-06-03,2,2006-02-15
4,5,2005-05-24,2079,222,2005-06-02,1,2006-02-15

In [72]:
may_total = pd.read_sql_query('SELECT customer_id, COUNT(customer_id) AS may_total FROM rentals_may GROUP BY customer_id', engine)
may_total.head(5)

   customer_id  may_total
0          130          2
1          459          1
2          408          3
3          333          1
4          222          5

#### 3. Check the number of rentals for each customer for `June`

In [73]:
june_rentals = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine)
june_rentals.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14,1632,416,2005-06-18,2,2006-02-15
1,1159,2005-06-14,4395,516,2005-06-17,1,2006-02-15
2,1160,2005-06-14,2795,239,2005-06-18,2,2006-02-15
3,1161,2005-06-14,1690,285,2005-06-21,1,2006-02-15
4,1162,2005-06-14,987,310,2005-06-23,1,2006-02-15

In [74]:
june_total = pd.read_sql_query('SELECT customer_id, COUNT(customer_id) AS june_total FROM rentals_june GROUP BY customer_id', engine)
june_total.head(5)

   customer_id  june_total
0          416           5
1          516           6
2          239           5
3          285           3
4          310           6

##### 4. Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [77]:
def may_vs_june():
    merged = pd.DataFrame.merge(may_total, june_total)
    merged['greater_in_may'] = merged["may_total"] > merged["june_total"]
    merged['greater_in_june'] = merged["may_total"] < merged["june_total"]
    return merged.head()

In [78]:
may_vs_june()

   customer_id  may_total  june_total  greater_in_may  greater_in_june
0          130          2           6           False             True
1          459          1           7           False             True
2          408          3           3           False            False
3          333          1           4           False             True
4          222          5           2            True            False

##### Isidre Munné-Bertran